InformationRegisters/ХарактеристикиОбъектовПоМедРегистру.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ХарактеристикиОбъектовПоМедРегистру</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыКлассификаторовМедРегистра</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УченыеСтепени</v8:Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
						<v8:Type>cfg:EnumRef.СостоянияСотрудника</v8:Type>
						<v8:Type>cfg:EnumRef.ОтношениеКВоинскойОбязанности</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСпециальностейПоОбразованию</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
						<v8:Type>cfg:CatalogRef.Награды</v8:Type>
						<v8:Type>cfg:CatalogRef.РазрядыКатегорииДолжностей</v8:Type>
						<v8:Type>cfg:CatalogRef.ОснованияУвольнения</v8:Type>
						<v8:Type>cfg:CatalogRef.УдалитьОснованияУвольнения</v8:Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
						<v8:Type>cfg:EnumRef.КатегорииДолжностейДляСтатистическогоУчета</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ОбразованиеФизическихЛиц</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыОбразованияФизическихЛиц</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыКадровыхСобытий</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыЗанятости</v8:Type>
						<v8:Type>cfg:CatalogRef.УчебныеЗаведения</v8:Type>
						<v8:Type>cfg:CatalogRef.СостояниеВБраке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Классификатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыМедРегистра</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ХарактеристикиОбъектовПоМедРегистру/Forms/РедактированиеХарактеристикОбъекта/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриПолученииДанныхНаСервере();	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбъектВладелец = Параметры.Объект;

    ПриПолученииДанныхНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗагруженыКлассификаторыМедРегистра" Тогда
		ОбновитьНаборЗаписейНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПриПолученииДанныхНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("КлассифицированОбъектМетаданныхПоМедРегистру", ОбъектВладелец);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНаборЗаписей

&НаКлиенте
Процедура ХарактеристикаПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриПолученииДанныхНаСервере()
	
	Если Не ЗначениеЗаполнено(ОбъектВладелец) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаХарактеристик = РегистрыСведений.ХарактеристикиОбъектовПоМедРегистру.ХарактеристикиОбъектаМетаданныхДляРегистра(ТипЗнч(ОбъектВладелец));
	
	Если НаборЗаписей.Количество() <> ТаблицаХарактеристик.Количество() Тогда
		НаборЗаписей.Загрузить( РегистрыСведений.ХарактеристикиОбъектовПоМедРегистру.ЗаполненныеХарактеристикиОбъектаМетаданных(ОбъектВладелец) );
	КонецЕсли;
	
	// Заполним представление элемента из характеристик связей объектов метаданных по мед. регистру.
	Для Каждого СтрокаНабораЗаписей Из НаборЗаписей Цикл
		
		Если ПустаяСтрока(СтрокаНабораЗаписей.ПредставлениеХарактеристики) Тогда
			
			Характеристика = ТаблицаХарактеристик.Найти(СтрокаНабораЗаписей.Классификатор, "Классификатор");
			Если Характеристика <> Неопределено Тогда
				СтрокаНабораЗаписей.ПредставлениеХарактеристики = Характеристика.ПредставлениеХарактеристики ;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаДляСортировки = НаборЗаписей.Выгрузить();
	ТаблицаДляСортировки.Сортировать("ПредставлениеХарактеристики Возр");
	НаборЗаписей.Загрузить(ТаблицаДляСортировки);

КонецПроцедуры

&НаСервере
Процедура ОбновитьНаборЗаписейНаСервере()
	
	Если Модифицированность Тогда
		
		Записать();
		Модифицированность = Ложь;
		
	КонецЕсли;
	
	НаборЗаписей.Очистить();
	
	ПриПолученииДанныхНаСервере();
	
КонецПроцедуры

#КонецОбласти
